Show / Hide Table of Contents
Class MprlRecord
Parameter which represts the general record in IDEA MPRL
Inheritance
System.Object
MprlRecord
BoltParam
CrossSectionParam
MaterialParam
WeldParam
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Parameters
Assembly: IdeaRS.OpenModel.dll
Syntax
[DataContract]
[Serializable]
[KnownType(typeof(AnchorParam))]
[KnownType(typeof(BoltParam))]
[KnownType(typeof(CrossSectionParam))]
[KnownType(typeof(MaterialParam))]
[KnownType(typeof(WeldParam))]
public class MprlRecord
Properties
Improve this Doc   View Source
ItemId
Mprl ItemId
Declaration
[DataMember]
public Guid ItemId { get; set; }
Property Value
 Type |  Description
 System.Guid
Improve this Doc   View Source
Name
Name of the item
Declaration
[DataMember]
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
TableId
Mprl TableId
Declaration
[DataMember]
public Guid TableId { get; set; }
Property Value
 Type |  Description
 System.Guid
 Improve this Doc
 View Source